IDENTIFICATION DIVISION.
PROGRAM-ID. NUMBERS.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-NUMBER PIC 9(5) VALUE 12345.
01 WS-RESULT PIC 9(6).
PROCEDURE DIVISION.
MAIN.
    COMPUTE WS-RESULT = WS-NUMBER * 2.
    DISPLAY "INPUT: " WS-NUMBER.
    DISPLAY "RESULT: " WS-RESULT.
    STOP RUN.
